cmsis-svd/cmsis-svd/data/HDSC/HC32M140JX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CT3_PWC</name>
            <description>desc CT_PWC</description>
            <baseAddress>0x400250C0</baseAddress>
            <alternatePeripheral>CT3_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
            <registers>
                <register>
                    <name>DBUF</name>
                    <description>desc DBUF</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>TCR</name>
                    <description>desc TCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77F6</resetMask>
                    <fields>
                        <field>
                            <name>ENCNT</name>
                            <description>desc ENCNT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODS</name>
                            <description>desc MODS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FUNC</name>
                            <description>desc FUNC</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T32</name>
                            <description>desc T32</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGS</name>
                            <description>desc EDGS</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKS</name>
                            <description>desc CLKS</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STA</name>
                    <description>desc STA</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD5</resetMask>
                    <fields>
                        <field>
                            <name>OVIR</name>
                            <description>desc OVIR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCIR</name>
                            <description>desc MCIR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVIE</name>
                            <description>desc OVIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCIE</name>
                            <description>desc MCIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERR</name>
                            <description>desc ERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCR2</name>
                    <description>desc TCR2</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>CLKS3</name>
                            <description>desc CLKS3</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
