cmsis-svd/cmsis-svd/data/HDSC/HC32M140JX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>UID</name>
            <description>desc UID</description>
            <baseAddress>0x40000100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>UIDR0</name>
                    <description>desc UIDR0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UIDR1</name>
                    <description>desc UIDR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UIDR2</name>
                    <description>desc UIDR2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UID</name>
                            <description>desc UID</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>VC</name>
            <description>desc VC</description>
            <baseAddress>0x4003C300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x9</size>
            </addressBlock>
            <registers>
                <register>
                    <name>VC_CTL1</name>
                    <description>desc VC_CTL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x18</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>VC_EN</name>
                            <description>desc VC_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_OUT</name>
                            <description>desc VC_OUT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VC_NMODE</name>
                            <description>desc VC_NMODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_COMPSL</name>
                            <description>desc VC_COMPSL</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC_CTL2</name>
                    <description>desc VC_CTL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFEF</resetMask>
                    <fields>
                        <field>
                            <name>VC_FILTER_EN</name>
                            <description>desc VC_FILTER_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_RESPONSE</name>
                            <description>desc VC_RESPONSE</description>
                            <msb>3</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCINT_EDGE</name>
                            <description>desc VCINT_EDGE</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCINT_HIGH</name>
                            <description>desc VCINT_HIGH</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC2PT</name>
                            <description>desc VC2PT</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIE</name>
                            <description>desc VCIE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCIF</name>
                            <description>desc VCIF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_HYS_SEL</name>
                            <description>desc VC_HYS_SEL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC_CTL3</name>
                    <description>desc VC_CTL3</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>VC_TM0G</name>
                            <description>desc VC_TM0G</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_TM2G</name>
                            <description>desc VC_TM2G</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
